{"backend": "tensorflow", "class_name": "Model", "config": {"name": "model_1", "output_layers": [["conv2d_15", 0, 0]], "input_layers": [["input_1", 0, 0]], "layers": [{"name": "input_1", "inbound_nodes": [], "class_name": "InputLayer", "config": {"batch_input_shape": [null, 50, 50, 2], "dtype": "float32", "sparse": false, "name": "input_1"}}, {"name": "conv2d_1", "inbound_nodes": [[["input_1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"name": "conv2d_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "mode": "fan_in", "seed": null}}, "dilation_rate": [1, 1], "kernel_regularizer": null, "activation": "relu", "strides": [1, 1], "activity_regularizer": null, "use_bias": true, "kernel_constraint": null, "kernel_size": [3, 3], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "padding": "same", "filters": 64, "data_format": "channels_last", "trainable": true}}, {"name": "conv2d_2", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"name": "conv2d_2", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "mode": "fan_in", "seed": null}}, "dilation_rate": [1, 1], "kernel_regularizer": null, "activation": "linear", "strides": [1, 1], "activity_regularizer": null, "use_bias": true, "kernel_constraint": null, "kernel_size": [3, 3], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "padding": "same", "filters": 64, "data_format": "channels_last", "trainable": true}}, {"name": "batch_normalization_1", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"name": "batch_normalization_1", "momentum": 0.99, "epsilon": 0.001, "gamma_regularizer": null, "axis": -1, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "beta_constraint": null, "beta_regularizer": null, "trainable": true}}, {"name": "activation_1", "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_1", "activation": "relu", "trainable": true}}, {"name": "conv2d_3", "inbound_nodes": [[["activation_1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"name": "conv2d_3", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "mode": "fan_in", "seed": null}}, "dilation_rate": [1, 1], "kernel_regularizer": null, "activation": "linear", "strides": [1, 1], "activity_regularizer": null, "use_bias": true, "kernel_constraint": null, "kernel_size": [3, 3], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "padding": "same", "filters": 64, "data_format": "channels_last", "trainable": true}}, {"name": "batch_normalization_2", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"name": "batch_normalization_2", "momentum": 0.99, "epsilon": 0.001, "gamma_regularizer": null, "axis": -1, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "beta_constraint": null, "beta_regularizer": null, "trainable": true}}, {"name": "add_1", "inbound_nodes": [[["batch_normalization_2", 0, 0, {}], ["conv2d_1", 0, 0, {}]]], "class_name": "Add", "config": {"name": "add_1", "trainable": true}}, {"name": "conv2d_4", "inbound_nodes": [[["add_1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"name": "conv2d_4", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "mode": "fan_in", "seed": null}}, "dilation_rate": [1, 1], "kernel_regularizer": null, "activation": "linear", "strides": [1, 1], "activity_regularizer": null, "use_bias": true, "kernel_constraint": null, "kernel_size": [3, 3], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "padding": "same", "filters": 64, "data_format": "channels_last", "trainable": true}}, {"name": "batch_normalization_3", "inbound_nodes": [[["conv2d_4", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"name": "batch_normalization_3", "momentum": 0.99, "epsilon": 0.001, "gamma_regularizer": null, "axis": -1, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "beta_constraint": null, "beta_regularizer": null, "trainable": true}}, {"name": "activation_2", "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_2", "activation": "relu", "trainable": true}}, {"name": "conv2d_5", "inbound_nodes": [[["activation_2", 0, 0, {}]]], "class_name": "Conv2D", "config": {"name": "conv2d_5", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "mode": "fan_in", "seed": null}}, "dilation_rate": [1, 1], "kernel_regularizer": null, "activation": "linear", "strides": [1, 1], "activity_regularizer": null, "use_bias": true, "kernel_constraint": null, "kernel_size": [3, 3], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "padding": "same", "filters": 64, "data_format": "channels_last", "trainable": true}}, {"name": "batch_normalization_4", "inbound_nodes": [[["conv2d_5", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"name": "batch_normalization_4", "momentum": 0.99, "epsilon": 0.001, "gamma_regularizer": null, "axis": -1, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "beta_constraint": null, "beta_regularizer": null, "trainable": true}}, {"name": "add_2", "inbound_nodes": [[["batch_normalization_4", 0, 0, {}], ["add_1", 0, 0, {}]]], "class_name": "Add", "config": {"name": "add_2", "trainable": true}}, {"name": "conv2d_6", "inbound_nodes": [[["add_2", 0, 0, {}]]], "class_name": "Conv2D", "config": {"name": "conv2d_6", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "mode": "fan_in", "seed": null}}, "dilation_rate": [1, 1], "kernel_regularizer": null, "activation": "linear", "strides": [1, 1], "activity_regularizer": null, "use_bias": true, "kernel_constraint": null, "kernel_size": [3, 3], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "padding": "same", "filters": 64, "data_format": "channels_last", "trainable": true}}, {"name": "batch_normalization_5", "inbound_nodes": [[["conv2d_6", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"name": "batch_normalization_5", "momentum": 0.99, "epsilon": 0.001, "gamma_regularizer": null, "axis": -1, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "beta_constraint": null, "beta_regularizer": null, "trainable": true}}, {"name": "activation_3", "inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_3", "activation": "relu", "trainable": true}}, {"name": "conv2d_7", "inbound_nodes": [[["activation_3", 0, 0, {}]]], "class_name": "Conv2D", "config": {"name": "conv2d_7", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "mode": "fan_in", "seed": null}}, "dilation_rate": [1, 1], "kernel_regularizer": null, "activation": "linear", "strides": [1, 1], "activity_regularizer": null, "use_bias": true, "kernel_constraint": null, "kernel_size": [3, 3], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "padding": "same", "filters": 64, "data_format": "channels_last", "trainable": true}}, {"name": "batch_normalization_6", "inbound_nodes": [[["conv2d_7", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"name": "batch_normalization_6", "momentum": 0.99, "epsilon": 0.001, "gamma_regularizer": null, "axis": -1, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "beta_constraint": null, "beta_regularizer": null, "trainable": true}}, {"name": "add_3", "inbound_nodes": [[["batch_normalization_6", 0, 0, {}], ["add_2", 0, 0, {}]]], "class_name": "Add", "config": {"name": "add_3", "trainable": true}}, {"name": "conv2d_8", "inbound_nodes": [[["add_3", 0, 0, {}]]], "class_name": "Conv2D", "config": {"name": "conv2d_8", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "mode": "fan_in", "seed": null}}, "dilation_rate": [1, 1], "kernel_regularizer": null, "activation": "linear", "strides": [1, 1], "activity_regularizer": null, "use_bias": true, "kernel_constraint": null, "kernel_size": [3, 3], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "padding": "same", "filters": 64, "data_format": "channels_last", "trainable": true}}, {"name": "batch_normalization_7", "inbound_nodes": [[["conv2d_8", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"name": "batch_normalization_7", "momentum": 0.99, "epsilon": 0.001, "gamma_regularizer": null, "axis": -1, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "beta_constraint": null, "beta_regularizer": null, "trainable": true}}, {"name": "activation_4", "inbound_nodes": [[["batch_normalization_7", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_4", "activation": "relu", "trainable": true}}, {"name": "conv2d_9", "inbound_nodes": [[["activation_4", 0, 0, {}]]], "class_name": "Conv2D", "config": {"name": "conv2d_9", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "mode": "fan_in", "seed": null}}, "dilation_rate": [1, 1], "kernel_regularizer": null, "activation": "linear", "strides": [1, 1], "activity_regularizer": null, "use_bias": true, "kernel_constraint": null, "kernel_size": [3, 3], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "padding": "same", "filters": 64, "data_format": "channels_last", "trainable": true}}, {"name": "batch_normalization_8", "inbound_nodes": [[["conv2d_9", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"name": "batch_normalization_8", "momentum": 0.99, "epsilon": 0.001, "gamma_regularizer": null, "axis": -1, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "beta_constraint": null, "beta_regularizer": null, "trainable": true}}, {"name": "add_4", "inbound_nodes": [[["batch_normalization_8", 0, 0, {}], ["add_3", 0, 0, {}]]], "class_name": "Add", "config": {"name": "add_4", "trainable": true}}, {"name": "conv2d_10", "inbound_nodes": [[["add_4", 0, 0, {}]]], "class_name": "Conv2D", "config": {"name": "conv2d_10", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "mode": "fan_in", "seed": null}}, "dilation_rate": [1, 1], "kernel_regularizer": null, "activation": "linear", "strides": [1, 1], "activity_regularizer": null, "use_bias": true, "kernel_constraint": null, "kernel_size": [3, 3], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "padding": "same", "filters": 64, "data_format": "channels_last", "trainable": true}}, {"name": "batch_normalization_9", "inbound_nodes": [[["conv2d_10", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"name": "batch_normalization_9", "momentum": 0.99, "epsilon": 0.001, "gamma_regularizer": null, "axis": -1, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "beta_constraint": null, "beta_regularizer": null, "trainable": true}}, {"name": "activation_5", "inbound_nodes": [[["batch_normalization_9", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_5", "activation": "relu", "trainable": true}}, {"name": "conv2d_11", "inbound_nodes": [[["activation_5", 0, 0, {}]]], "class_name": "Conv2D", "config": {"name": "conv2d_11", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "mode": "fan_in", "seed": null}}, "dilation_rate": [1, 1], "kernel_regularizer": null, "activation": "linear", "strides": [1, 1], "activity_regularizer": null, "use_bias": true, "kernel_constraint": null, "kernel_size": [3, 3], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "padding": "same", "filters": 64, "data_format": "channels_last", "trainable": true}}, {"name": "batch_normalization_10", "inbound_nodes": [[["conv2d_11", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"name": "batch_normalization_10", "momentum": 0.99, "epsilon": 0.001, "gamma_regularizer": null, "axis": -1, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "beta_constraint": null, "beta_regularizer": null, "trainable": true}}, {"name": "add_5", "inbound_nodes": [[["batch_normalization_10", 0, 0, {}], ["add_4", 0, 0, {}]]], "class_name": "Add", "config": {"name": "add_5", "trainable": true}}, {"name": "conv2d_12", "inbound_nodes": [[["add_5", 0, 0, {}]]], "class_name": "Conv2D", "config": {"name": "conv2d_12", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "mode": "fan_in", "seed": null}}, "dilation_rate": [1, 1], "kernel_regularizer": null, "activation": "linear", "strides": [1, 1], "activity_regularizer": null, "use_bias": true, "kernel_constraint": null, "kernel_size": [3, 3], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "padding": "same", "filters": 64, "data_format": "channels_last", "trainable": true}}, {"name": "batch_normalization_11", "inbound_nodes": [[["conv2d_12", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"name": "batch_normalization_11", "momentum": 0.99, "epsilon": 0.001, "gamma_regularizer": null, "axis": -1, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "beta_constraint": null, "beta_regularizer": null, "trainable": true}}, {"name": "activation_6", "inbound_nodes": [[["batch_normalization_11", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_6", "activation": "relu", "trainable": true}}, {"name": "conv2d_13", "inbound_nodes": [[["activation_6", 0, 0, {}]]], "class_name": "Conv2D", "config": {"name": "conv2d_13", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "mode": "fan_in", "seed": null}}, "dilation_rate": [1, 1], "kernel_regularizer": null, "activation": "linear", "strides": [1, 1], "activity_regularizer": null, "use_bias": true, "kernel_constraint": null, "kernel_size": [3, 3], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "padding": "same", "filters": 64, "data_format": "channels_last", "trainable": true}}, {"name": "batch_normalization_12", "inbound_nodes": [[["conv2d_13", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"name": "batch_normalization_12", "momentum": 0.99, "epsilon": 0.001, "gamma_regularizer": null, "axis": -1, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "beta_constraint": null, "beta_regularizer": null, "trainable": true}}, {"name": "add_6", "inbound_nodes": [[["batch_normalization_12", 0, 0, {}], ["add_5", 0, 0, {}]]], "class_name": "Add", "config": {"name": "add_6", "trainable": true}}, {"name": "conv2d_14", "inbound_nodes": [[["add_6", 0, 0, {}]]], "class_name": "Conv2D", "config": {"name": "conv2d_14", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "mode": "fan_in", "seed": null}}, "dilation_rate": [1, 1], "kernel_regularizer": null, "activation": "linear", "strides": [1, 1], "activity_regularizer": null, "use_bias": true, "kernel_constraint": null, "kernel_size": [3, 3], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "padding": "same", "filters": 64, "data_format": "channels_last", "trainable": true}}, {"name": "batch_normalization_13", "inbound_nodes": [[["conv2d_14", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"name": "batch_normalization_13", "momentum": 0.99, "epsilon": 0.001, "gamma_regularizer": null, "axis": -1, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "beta_constraint": null, "beta_regularizer": null, "trainable": true}}, {"name": "add_7", "inbound_nodes": [[["batch_normalization_13", 0, 0, {}], ["conv2d_1", 0, 0, {}]]], "class_name": "Add", "config": {"name": "add_7", "trainable": true}}, {"name": "conv2d_15", "inbound_nodes": [[["add_7", 0, 0, {}]]], "class_name": "Conv2D", "config": {"name": "conv2d_15", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "normal", "scale": 2.0, "mode": "fan_in", "seed": null}}, "dilation_rate": [1, 1], "kernel_regularizer": null, "activation": "linear", "strides": [1, 1], "activity_regularizer": null, "use_bias": true, "kernel_constraint": null, "kernel_size": [1, 1], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "padding": "same", "filters": 1, "data_format": "channels_last", "trainable": true}}]}, "keras_version": "2.0.4"}