____________________________________________________________________________________________________
Layer (type)                     Output Shape          Param #     Connected to                     
====================================================================================================
input_1 (InputLayer)             (None, 50, 50, 2)     0                                            
____________________________________________________________________________________________________
conv2d_1 (Conv2D)                (None, 50, 50, 64)    1216        input_1[0][0]                    
____________________________________________________________________________________________________
conv2d_2 (Conv2D)                (None, 50, 50, 64)    36928       conv2d_1[0][0]                   
____________________________________________________________________________________________________
batch_normalization_1 (BatchNorm (None, 50, 50, 64)    256         conv2d_2[0][0]                   
____________________________________________________________________________________________________
activation_1 (Activation)        (None, 50, 50, 64)    0           batch_normalization_1[0][0]      
____________________________________________________________________________________________________
conv2d_3 (Conv2D)                (None, 50, 50, 64)    36928       activation_1[0][0]               
____________________________________________________________________________________________________
batch_normalization_2 (BatchNorm (None, 50, 50, 64)    256         conv2d_3[0][0]                   
____________________________________________________________________________________________________
add_1 (Add)                      (None, 50, 50, 64)    0           batch_normalization_2[0][0]      
                                                                   conv2d_1[0][0]                   
____________________________________________________________________________________________________
conv2d_4 (Conv2D)                (None, 50, 50, 64)    36928       add_1[0][0]                      
____________________________________________________________________________________________________
batch_normalization_3 (BatchNorm (None, 50, 50, 64)    256         conv2d_4[0][0]                   
____________________________________________________________________________________________________
activation_2 (Activation)        (None, 50, 50, 64)    0           batch_normalization_3[0][0]      
____________________________________________________________________________________________________
conv2d_5 (Conv2D)                (None, 50, 50, 64)    36928       activation_2[0][0]               
____________________________________________________________________________________________________
batch_normalization_4 (BatchNorm (None, 50, 50, 64)    256         conv2d_5[0][0]                   
____________________________________________________________________________________________________
add_2 (Add)                      (None, 50, 50, 64)    0           batch_normalization_4[0][0]      
                                                                   add_1[0][0]                      
____________________________________________________________________________________________________
conv2d_6 (Conv2D)                (None, 50, 50, 64)    36928       add_2[0][0]                      
____________________________________________________________________________________________________
batch_normalization_5 (BatchNorm (None, 50, 50, 64)    256         conv2d_6[0][0]                   
____________________________________________________________________________________________________
activation_3 (Activation)        (None, 50, 50, 64)    0           batch_normalization_5[0][0]      
____________________________________________________________________________________________________
conv2d_7 (Conv2D)                (None, 50, 50, 64)    36928       activation_3[0][0]               
____________________________________________________________________________________________________
batch_normalization_6 (BatchNorm (None, 50, 50, 64)    256         conv2d_7[0][0]                   
____________________________________________________________________________________________________
add_3 (Add)                      (None, 50, 50, 64)    0           batch_normalization_6[0][0]      
                                                                   add_2[0][0]                      
____________________________________________________________________________________________________
conv2d_8 (Conv2D)                (None, 50, 50, 64)    36928       add_3[0][0]                      
____________________________________________________________________________________________________
batch_normalization_7 (BatchNorm (None, 50, 50, 64)    256         conv2d_8[0][0]                   
____________________________________________________________________________________________________
activation_4 (Activation)        (None, 50, 50, 64)    0           batch_normalization_7[0][0]      
____________________________________________________________________________________________________
conv2d_9 (Conv2D)                (None, 50, 50, 64)    36928       activation_4[0][0]               
____________________________________________________________________________________________________
batch_normalization_8 (BatchNorm (None, 50, 50, 64)    256         conv2d_9[0][0]                   
____________________________________________________________________________________________________
add_4 (Add)                      (None, 50, 50, 64)    0           batch_normalization_8[0][0]      
                                                                   add_3[0][0]                      
____________________________________________________________________________________________________
conv2d_10 (Conv2D)               (None, 50, 50, 64)    36928       add_4[0][0]                      
____________________________________________________________________________________________________
batch_normalization_9 (BatchNorm (None, 50, 50, 64)    256         conv2d_10[0][0]                  
____________________________________________________________________________________________________
activation_5 (Activation)        (None, 50, 50, 64)    0           batch_normalization_9[0][0]      
____________________________________________________________________________________________________
conv2d_11 (Conv2D)               (None, 50, 50, 64)    36928       activation_5[0][0]               
____________________________________________________________________________________________________
batch_normalization_10 (BatchNor (None, 50, 50, 64)    256         conv2d_11[0][0]                  
____________________________________________________________________________________________________
add_5 (Add)                      (None, 50, 50, 64)    0           batch_normalization_10[0][0]     
                                                                   add_4[0][0]                      
____________________________________________________________________________________________________
conv2d_12 (Conv2D)               (None, 50, 50, 64)    36928       add_5[0][0]                      
____________________________________________________________________________________________________
batch_normalization_11 (BatchNor (None, 50, 50, 64)    256         conv2d_12[0][0]                  
____________________________________________________________________________________________________
activation_6 (Activation)        (None, 50, 50, 64)    0           batch_normalization_11[0][0]     
____________________________________________________________________________________________________
conv2d_13 (Conv2D)               (None, 50, 50, 64)    36928       activation_6[0][0]               
____________________________________________________________________________________________________
batch_normalization_12 (BatchNor (None, 50, 50, 64)    256         conv2d_13[0][0]                  
____________________________________________________________________________________________________
add_6 (Add)                      (None, 50, 50, 64)    0           batch_normalization_12[0][0]     
                                                                   add_5[0][0]                      
____________________________________________________________________________________________________
conv2d_14 (Conv2D)               (None, 50, 50, 64)    36928       add_6[0][0]                      
____________________________________________________________________________________________________
batch_normalization_13 (BatchNor (None, 50, 50, 64)    256         conv2d_14[0][0]                  
____________________________________________________________________________________________________
add_7 (Add)                      (None, 50, 50, 64)    0           batch_normalization_13[0][0]     
                                                                   conv2d_1[0][0]                   
____________________________________________________________________________________________________
conv2d_15 (Conv2D)               (None, 50, 50, 1)     65          add_7[0][0]                      
====================================================================================================
Total params: 484,673
Trainable params: 483,009
Non-trainable params: 1,664
____________________________________________________________________________________________________
